export const changelogData = [
    {
        version: "1.1.1(3)",
        items: [
            "聊天插入增加算法插入\n优点：ai智力低下获取锚点容易出错的情况下插件会接管确保插入不会堆积在一起。\n缺点：可能情节点在图片之后发生",
            "按钮生成增加延迟等待，避免小手机等美化模拟流式输出导致按钮不渲染",
            "其它忘了"
        ]
    },
    {
        version: "1.1.1(2)",
        items: [
            "二次增加反重力破限，需要请点击恢复默认默认结构导入",
            "优化聊天插入正则，确保某些格式错误也能兼容",
            "强化提醒哈基米对生图数量的遵循"
        ]
    },
    {
        version: "1.1.1",
        items: [
            "优化角色生成器",
            "优化内存管理,占用降低到kb级别",
            "优化聊天插入结构,增加一个自定义补充条目"
        ]
    },
    {
        version: "1.1.0(7)",
        items: [
            "增加消息监听，避免个别低端设备内存映射过慢导致的不加载图片",
            "other增加即梦ai的调用"
        ]
    },
    {
        version: "1.1.0(6)",
        items: [
            "nai增加url获取方式，方便中转或者反代使用",
            "nai第三方代理增加导演工具(情绪，去除文字等功能)"
        ]
    },
    {
        version: "1.1.0(5)",
        items: [
            "自动点击增加等待监听",
            "nai多角色增加格式兼容",
            "二次处理增加酒馆原生的宏与变量"
        ]
    },
    {
        version: "1.1.0(5)",
        items: [
            "部分事件与监听修改为酒馆原生，避免内存泄漏"
        ]
    },
    {
        version: "1.1.0(4)",
        items: [
            "other模式增加自定义字段格式错误的提示",
            "增加部分功能的资源不需要时释放",
            "修复同层卡编辑后无法重新渲染图片的问题"
        ]
    },
    {
        version: "1.1.0(3)",
        items: [
            "适配nai官方渠道新功能"
        ]
    },
    {
        version: "1.1.0(2)",
        items: [
            "other模式增加大量渠道兼容，已测试过的有火山、硅基、豆包、kimi(月之暗面)、智谱等等",
            "other现在可以进行图生图，文生图，图生视频，文生视频。首尾帧多图片合成视频",
            "三击功能增加限制，避免手机端容易触发"
        ]
    },
    {
        version: "1.1.0",
        items: [
            "三击楼层快速编辑tag",
            "隐藏小铅笔附近按钮功能"
        ]
    },
    {
        version: "1.0.9(12)",
        items: [
            "优化图片编辑功能",
            "增加群友小孩推荐的other白嫖渠道格式支持"
        ]
    },
    {
        version: "1.0.9(11)",
        items: [
            "更新防傻瓜操作提示",
            "插入处理增加一致性参考",
            "更新标签超市标签"
        ]
    },
    {
        version: "1.0.9(10)",
        items: [
            "other模式常见 API 预设区域增加NovelAI兼容预设，点击自动添加参数",
            "other模式增加自定义占位符下拉框，键值用|分隔符号分隔会自动生成下拉框"
        ]
    },
    {
        version: "1.0.9(9)",
        items: [
            "增加token统计功能，方便查看触发条目",
            "优化图片加载，优化切换设备需要刷新页面的问题"
        ]
    },
    {
        version: "1.0.9(8)",
        items: [
            "增加other模式占位符格式",
            "通用参数修改为实时更新"
        ]
    },
    {
        version: "1.0.9(7)",
        items: [
            "触发词长句兼容",
            "分辨率及时显示",
            "nai代理非流适配"
        ]
    },
    {
        version: "1.0.9(6)",
        items: [
            "修复世界书深度显示不一致的问题"
        ]
    },
    {
        version: "1.0.9(6)",
        items: [
            "other api模式增加自定义请求字段",
            "other api模式添加预设管理"
        ]
    },
    {
        version: "1.0.9(6)",
        items: [
            "增加快捷生成角色",
            "增加隐私模式",
            "最大显示数量做了一半()"
        ]
    },
    {
        version: "1.0.9(5)",
        items: [
            "nai增加消除文字，气泡功能",
            "nai官方渠道图生图增加便捷编辑功能"
        ]
    },
    {
        version: "1.0.9(5)",
        items: [
            "优化前端卡交互",
            "优化导出功能，避免部分设备无法导入",
            "修复长按无法使用浏览器保存的当前图片",
            "优化提示词预设图片显示"
        ]
    },
    {
        version: "1.0.9(3)",
        items: [
            "触发词改为精准匹配",
            "api预设增加更新按钮",
            "多选增加下载按钮",
            "增加opai格式兼容"
        ]
    },
    {
        version: "1.0.9(2)",
        items: [
            "增加回复监听"
        ]
    },
    {
        version: "1.0.9",
        items: [
            "修改浏览器加载逻辑",
            "标签超市新增加分类",
            "增加二次预设互斥"
        ]
    },
    {
        version: "2026.1.16",
        items: [
            "优化加载逻辑",
            "多选导出预设",
            "长按悬浮球切换画风",
            "修复导出预设不带参考图"
        ]
    },
    {
        version: "2026.1.15",
        items: [
            "优化插入聊天按钮，改为悬浮球",
            "为角色生成增加操作世界书功能"
        ]
    },
    {
        version: "2026.1.14",
        items: [
            "修复字段错误导致的不读取服务器配置问题",
            "优化角色生成功能，批量创建角色"
        ]
    },
    {
        version: "2026.1.13",
        items: [
            "增加多个预设",
            "增加聊天快捷按钮",
            "对部分数据进行切分处理"
        ]
    },
    {
        version: "1.0.8",
        items: [
            "新增二次处理小剧场功能",
            "会根据当前剧情的上下文插入返回内容"
        ]
    },
    {
        version: "1.0.7",
        items: [
            "优化二次处理，增加根据聊天记录批量处理",
            "优化批量处理拼接结构"
        ]
    },
    {
        version: "2026-1-12",
        items: [
            "增加人性化提示",
            "取消跨设备数据懒加载"
        ]
    },
    {
        version: "v1.0.6(3)",
        items: [
            "增加na官方渠道情绪化模块",
            "修复流式加载"
        ]
    },
    {
        version: "v1.0.5(5)",
        items: [
            "增加原图/缩略图显示切换",
            "增加用户日志方便查看",
            "修复标签超市高度过小有可能的挤压问题",
            "为小宝宝增加快捷修改工作流与各种有可能的错误提示",
            "增加触发词格式适配，预防宝宝操作导致的不能触发问题"
        ]
    },
    {
        version: "v1.0.4(2)",
        items: [
            "修复发现的小问题",
            "重构加载逻辑",
            "提示词预览图快捷生成",
            "优化存取，达到打开秒加载",
            "优化nai文件管理，按需加载。解决保存响应慢的问题"
        ]
    },
    {
        version: "v1.0.3",
        items: [
            "优化缓存管理",
            "重构二次处理插入逻辑与结构"
        ]
    },
    {
        version: "2026-1-7(3)",
        items: [
            "修复元数据残留问题"
        ]
    }
];
