export const changelogData = [
    {
        version: "1.1.5(6)",
        items: [
            "优化二次处理结构，有可能会解决挂姿势库等导致的截断问题"
        ]
    },
    {
        version: "1.1.5(5)",
        items: [
            "添加某些变态群友想要的女骑士模拟器,后续会考虑加入ai推衍功能与喜好设定()",
            "增加小手机最大上下文的设定",
            "小说增加最大上下文、最大读取大纲的设定"
        ]
    },
    {
        version: "1.1.5(4)",
        items: [
            "优化收纳盒布局",
            "小说功能重构完成", 
            "小说功能增加群友帮忙添加的多个xp分类"
        ]
    },
    {
        version: "1.1.5(3)",
        items: [
            "新增人生模拟器功能,附带原生与自定义ai功能",
            "小说模式优化重构中、目前不建议游玩"
        ]
    },
    {
        version: "1.1.5(2)",
        items: [
            "新增加小说阅读器，内置小说生成。分类xp等功能",
            "目前还是半成品、预设没构思好。不建议游玩、有兴趣体验后可提下建议方便后续开发"
        ]
    },
    {
        version: "1.1.5",
        items: [
            "基于功能逐步扩展悬浮球的增加、也为适配后续功能的开发优化。增加一个悬浮ui的收纳盒，便于整理界面",
            "对论坛、朋友圈、隐私朋友圈进行大量重构。增加了自定义内容、设置。发布历史上下文参考等",
            "为转账预设增加触发词功能、未触发前不会进行读取。并且增加钱包功能，防止npc无限转账(后续将联动直播或其它交易功能)",
            "增加朋友圈、私密朋友圈，交易性格等自定义设置",
            "转账添加预防措施、哪怕ai抽风强行转账。代码也会修改为转账失败。",
            "论坛风格请在论坛页面点击+号进行修改、其它相关更新内容点击联系人设置修改",
            "新朋友功能将适配新增的内容"
        ]
    },
    {
        version: "1.1.4(10)",
        items: [
            "修复多角色有时候重置回默认的问题",
            "修复打开联系人显示错误的问题",
            "对大部分预设进行优化",
            "优化小手机的对应文件与功能，js文件全部进行模块化拆分。有问题麻烦提交一个Issues或者群内艾特看见会修",
            "增加把新朋友添加进世界书的功能，点击头像进入对应界面(世界书已经存在的不建议使用、该功能是根据角色信息简介等完善角色设定)",
        ]
    },
    {
        version: "1.1.4(9)",
        items: [
            "小手机增加新朋友功能、自动设置好有可能存在的角色",
            "接受的时候自动为角色设置好文风、聊天风格",
            "优化论坛的显示与预设",
            "重构了一下小手机的css文件，多分了几个出来(ai弄的，没测试。有问题的宝宝麻烦提交个Issues)",
        ]
    },
    {
        version: "1.1.4(8)",
        items: [
            "标签超市ui优化",
            "修复请求头删除不完整的问题",
            "标签超市最大加载改为30，滚动才进行懒加载。"
        ]
    },
    {
        version: "1.1.4(7)",
        items: [
            "优化css相关部分，避免部分云酒馆无显卡导致的渲染加载卡顿",
            "增加tag头自定义，点击多角色入口进行配置"
        ]
    },
    {
        version: "1.1.4(6)",
        items: [
            "修复多角色切割导致的长句触发词被抛弃的问题",
            "增加按钮生成的dom节点处理方式"
        ]
    },
    {
        version: "1.1.4(5)",
        items: [
            "优化私聊语音功能、增加批量操作语音入口",
            "增加清理总结标记功能"
        ]
    },
    {
        version: "1.1.4(4)",
        items: [
            "优化私聊总结功能、总结过的内容不参与上下文",
            "nai加入种子"
        ]
    },
    {
        version: "1.1.4(3)",
        items: [
            "修复语音时长显示问题导致的播放截断",
            "优化论坛返回功能",
            "论坛增加发帖功能",
            "主界面设置入口个人信息增加论坛昵称的设置",
        ]
    },
    {
        version: "1.1.4(2)",
        items: [
            "增加预设配置，可为不同请求单独配置预设分开使用模型调用等",
            "优化文生图、可以接受http等无证书的直链返回格式"
        ]
    },
    {
        version: "1.1.4",
        items: [
            "增加语音聊天功能，调用的火山豆包",
            "请在主界面设置入口提前配置好api等方便调用",
            "清在联系人设置中配置角色音色",
            "生成的角色可以选择注入到世界书、参与扮演"
        ]
    },
    {
        version: "1.1.3(2)",
        items: [
            "增加附近的人功能、在地图内使用",
            "生成附近的人时根据当前<user>所在位置决定，如果想换位置请进行移动",
            "生成的角色可以选择注入到世界书、参与扮演"
        ]
    },
    {
        version: "1.1.3",
        items: [
            "增加气泡、边框、字体等自定义功能",
            "增加壁纸功能，聊天背景",
            "群聊功能、每个角色单独使用api进行请求。数据隔离、防全知",
            "私聊群聊记录互通、角色群聊时可以读取到自身的私聊信息。私聊时可以读取到所有所在群的聊天信息、智能筛选，只会读取加入的群聊"
        ]
    },
    {
        version: "1.1.2(9)",
        items: [
            "优化模拟器聊天样式",
            "论坛增加预设、目前可正常使用。有空会优化玩法",
            "群聊功能已做完、每个角色单独一个api负责处理各自的消息。每个npc都属于自己预设中的主角，可以有效避免同api调用时的主次分级等现象。(这几天有空的话测试完优化预设就上线.)"
        ]
    },
    {
        version: "1.1.2(8)",
        items: [
            "优化文字配色",
            "联系人设置增加隐私朋友圈的风格，有效满足部分变态群友想要的特殊玩法",         
            "修复朋友圈连续生成按钮未显示排队导致的报错",
            "图片模式功能优化"
        ]
    },
    {
        version: "1.1.2(8)",
        items: [
            "增加隐私朋友圈风格设定",
            "发现世界书有些触发词是角色姓名，对话不出现的时候有时会遗漏，角色姓名默认加入世界书触发词(朋友圈,聊天,回复等都会默认加入姓名触发)",
            "增加朋友圈最大显示数量避免dom太多导致的卡顿，向下滚动可以加载历史"
        ]
    },
    {
        version: "1.1.2(7)",
        items: [
            "增加github仓库存储模式、把数据全部上传到个人仓库。",
            "优点:不占用设备空间，哪怕几万张图片不删除也不影响",
            "缺点:需要消耗流量去仓库请求资源、带宽低的设备加载有延迟",
            "删除与上传会消耗时间，带宽低的设备会比直接保存浏览器慢几秒"
        ]
    },
    {
        version: "1.1.2(6)",
        items: [
            "增加私密朋友圈,提供变态群友想要的偷窥玩法()",
            "优化朋友圈的请求预设，回复预设",
            "优化朋友圈评论功能、改为只加载新增内容、避免全屏闪烁抖动",
            "地图功能以做完，预设与玩法联动构思中"
        ]
    },
    {
        version: "1.1.2(5)",
        items: [
            "增加智能总结注入功能(聊天界面点击...打开)会自动抓取未总结过的聊天内容进行总结，总结过的自动跳过",
            "注入的内容自动绑定当前世界书",
            "缩小主屏幕高度"
        ]
    },
    {
        version: "1.1.2(4)",
        items: [
            "朋友圈增加图片功能",
            "朋友圈增加回复功能",
            "论坛功能等待预设更新"
        ]
    },
    {
        version: "1.1.2(3)",
        items: [
            "小手机播放器优化",
            "786px适配",
            "朋友圈增加分享功能",
            "论坛功能等待预设更新"
        ]
    },
    {
        version: "1.1.2(3)",
        items: [
            "小手机朋友圈开放、增加分享歌曲功能",
            "增加网易云播放器",
            "朋友圈预设还在构思中、暂时没加入图片功能",
            "论坛功能等待预设更新",
            "优化世界书功能，随时挂载",
            "优化长按事件，增加多选删除，复制等功能"
        ]
    },
    {
        version: "1.1.2(2)",
        items: [
            "小手机图片功能热加载，+号随时切换是否使用图片功能",
            "增加转账交互与功能,可收款对方发送的转账或者退回(为了让角色更符合背景设定(例如乞丐背景转账几千)、可能会加入背景检测功能)",
            "增加语气，文体风格功能",
            "主悬浮球与小手机进行偏离",
            "推荐：正常聊天尽量使用文字功能。想输出图片时在点击+号进行对话。不需要时关闭"
        ]
    },
    {
        version: "1.1.2",
        items: [
            "独立的手机模拟器聊天功能，可读取酒馆世界书与并发同时聊天",
            "论坛与朋友圈功能已做好，等待有空写预设即可上线",
        ]
    },
    {
        version: "1.1.1(4)",
        items: [
            "优化图生图编辑框",
            "nai重绘参数动态调节",
            "优化流式生成，改为酒馆监听"
        ]
    },
    {
        version: "1.1.1(3)",
        items: [
            "聊天插入增加算法插入\n优点：ai智力低下获取锚点容易出错的情况下插件会接管确保插入不会堆积在一起。\n缺点：可能情节点在图片之后发生",
            "按钮生成增加延迟等待，避免小手机等美化模拟流式输出导致按钮不渲染",
            "其它忘了"
        ]
    },
    {
        version: "1.1.1(2)",
        items: [
            "二次增加反重力破限，需要请点击恢复默认默认结构导入",
            "优化聊天插入正则，确保某些格式错误也能兼容",
            "强化提醒哈基米对生图数量的遵循"
        ]
    },
    {
        version: "1.1.1",
        items: [
            "优化角色生成器",
            "优化内存管理,占用降低到kb级别",
            "优化聊天插入结构,增加一个自定义补充条目"
        ]
    },
    {
        version: "1.1.0(7)",
        items: [
            "增加消息监听，避免个别低端设备内存映射过慢导致的不加载图片",
            "other增加即梦ai的调用"
        ]
    },
    {
        version: "1.1.0(6)",
        items: [
            "nai增加url获取方式，方便中转或者反代使用",
            "nai第三方代理增加导演工具(情绪，去除文字等功能)"
        ]
    },
    {
        version: "1.1.0(5)",
        items: [
            "自动点击增加等待监听",
            "nai多角色增加格式兼容",
            "二次处理增加酒馆原生的宏与变量"
        ]
    },
    {
        version: "1.1.0(5)",
        items: [
            "部分事件与监听修改为酒馆原生，避免内存泄漏"
        ]
    },
    {
        version: "1.1.0(4)",
        items: [
            "other模式增加自定义字段格式错误的提示",
            "增加部分功能的资源不需要时释放",
            "修复同层卡编辑后无法重新渲染图片的问题"
        ]
    },
    {
        version: "1.1.0(3)",
        items: [
            "适配nai官方渠道新功能"
        ]
    },
    {
        version: "1.1.0(2)",
        items: [
            "other模式增加大量渠道兼容，已测试过的有火山、硅基、豆包、kimi(月之暗面)、智谱等等",
            "other现在可以进行图生图，文生图，图生视频，文生视频。首尾帧多图片合成视频",
            "三击功能增加限制，避免手机端容易触发"
        ]
    },
    {
        version: "1.1.0",
        items: [
            "三击楼层快速编辑tag",
            "隐藏小铅笔附近按钮功能"
        ]
    },
    {
        version: "1.0.9(12)",
        items: [
            "优化图片编辑功能",
            "增加群友小孩推荐的other白嫖渠道格式支持"
        ]
    },
    {
        version: "1.0.9(11)",
        items: [
            "更新防傻瓜操作提示",
            "插入处理增加一致性参考",
            "更新标签超市标签"
        ]
    },
    {
        version: "1.0.9(10)",
        items: [
            "other模式常见 API 预设区域增加NovelAI兼容预设，点击自动添加参数",
            "other模式增加自定义占位符下拉框，键值用|分隔符号分隔会自动生成下拉框"
        ]
    },
    {
        version: "1.0.9(9)",
        items: [
            "增加token统计功能，方便查看触发条目",
            "优化图片加载，优化切换设备需要刷新页面的问题"
        ]
    },
    {
        version: "1.0.9(8)",
        items: [
            "增加other模式占位符格式",
            "通用参数修改为实时更新"
        ]
    },
    {
        version: "1.0.9(7)",
        items: [
            "触发词长句兼容",
            "分辨率及时显示",
            "nai代理非流适配"
        ]
    },
    {
        version: "1.0.9(6)",
        items: [
            "修复世界书深度显示不一致的问题"
        ]
    },
    {
        version: "1.0.9(6)",
        items: [
            "other api模式增加自定义请求字段",
            "other api模式添加预设管理"
        ]
    },
    {
        version: "1.0.9(6)",
        items: [
            "增加快捷生成角色",
            "增加隐私模式",
            "最大显示数量做了一半()"
        ]
    },
    {
        version: "1.0.9(5)",
        items: [
            "nai增加消除文字，气泡功能",
            "nai官方渠道图生图增加便捷编辑功能"
        ]
    },
    {
        version: "1.0.9(5)",
        items: [
            "优化前端卡交互",
            "优化导出功能，避免部分设备无法导入",
            "修复长按无法使用浏览器保存的当前图片",
            "优化提示词预设图片显示"
        ]
    },
    {
        version: "1.0.9(3)",
        items: [
            "触发词改为精准匹配",
            "api预设增加更新按钮",
            "多选增加下载按钮",
            "增加opai格式兼容"
        ]
    },
    {
        version: "1.0.9(2)",
        items: [
            "增加回复监听"
        ]
    },
    {
        version: "1.0.9",
        items: [
            "修改浏览器加载逻辑",
            "标签超市新增加分类",
            "增加二次预设互斥"
        ]
    },
    {
        version: "2026.1.16",
        items: [
            "优化加载逻辑",
            "多选导出预设",
            "长按悬浮球切换画风",
            "修复导出预设不带参考图"
        ]
    },
    {
        version: "2026.1.15",
        items: [
            "优化插入聊天按钮，改为悬浮球",
            "为角色生成增加操作世界书功能"
        ]
    },
    {
        version: "2026.1.14",
        items: [
            "修复字段错误导致的不读取服务器配置问题",
            "优化角色生成功能，批量创建角色"
        ]
    },
    {
        version: "2026.1.13",
        items: [
            "增加多个预设",
            "增加聊天快捷按钮",
            "对部分数据进行切分处理"
        ]
    },
    {
        version: "1.0.8",
        items: [
            "新增二次处理小剧场功能",
            "会根据当前剧情的上下文插入返回内容"
        ]
    },
    {
        version: "1.0.7",
        items: [
            "优化二次处理，增加根据聊天记录批量处理",
            "优化批量处理拼接结构"
        ]
    },
    {
        version: "2026-1-12",
        items: [
            "增加人性化提示",
            "取消跨设备数据懒加载"
        ]
    },
    {
        version: "v1.0.6(3)",
        items: [
            "增加na官方渠道情绪化模块",
            "修复流式加载"
        ]
    },
    {
        version: "v1.0.5(5)",
        items: [
            "增加原图/缩略图显示切换",
            "增加用户日志方便查看",
            "修复标签超市高度过小有可能的挤压问题",
            "为小宝宝增加快捷修改工作流与各种有可能的错误提示",
            "增加触发词格式适配，预防宝宝操作导致的不能触发问题"
        ]
    },
    {
        version: "v1.0.4(2)",
        items: [
            "修复发现的小问题",
            "重构加载逻辑",
            "提示词预览图快捷生成",
            "优化存取，达到打开秒加载",
            "优化nai文件管理，按需加载。解决保存响应慢的问题"
        ]
    },
    {
        version: "v1.0.3",
        items: [
            "优化缓存管理",
            "重构二次处理插入逻辑与结构"
        ]
    },
    {
        version: "2026-1-7(3)",
        items: [
            "修复元数据残留问题"
        ]
    }
];
